Что я сделал в рамках этой работы:
Мы создали зашифрованный туннель между двумя офисами (R1 и R3) через "интернет" (R2), чтобы передавать данные между сетями 192.168.1.0/24 и 192.168.3.0/24 безопасно.



IPsec (Internet Protocol Security) -это протокол, описывающий правила и технологии, которые создают и по которым работает тунелирование:

- Шифрование - данные превращаются в "нечитаемый код"
- Аутентификация - проверка, что на другом конце "свой"
- Целостность - гарантия, что данные не изменились по пути

Как работает (два этапа):
- Фаза 1 (IKE) - "Знакомство и договор" ( IKE - это протокол обмена ключами в интернете, служит для автоматической генерации и согласования ключей, входит в набор протоколов IPSec)
- R1 и R3 договариваются КАК они будут общаться

Что настроили:

- Шифрование: AES 256 ( симметричный алгоритм  блочного шифрования, цифра - определяет размер блока -> длинну ключа)
- Проверка подлинности: Pre-shared key (vpnpa55)
- Обмен ключами: Diffie-Hellman group 5

Фаза 2 (IPsec) - "Работа по правилам"
R1 и R3 договариваются ЧТО шифровать

Что настроили:

- Что шифровать: трафик между сетями 192.168.1.0/24 ↔ 192.168.3.0/24
- Как шифровать: ESP с AES + SHA ( ESP - протокол обеспечивающий безопастную передачу посредством шифрования и аутентификации. Он проверяет указали ли отрпавитель и получает одинаковый алгоритм и ключ шифрования)

Команды для демонстрации:
1. Проверить лицензию безопасности
R1# show version
Что В разделе Technology Package должно быть Security: Active

2. Проверить политику IKE (Фаза 1)
R1# show crypto isakmp policy
Что показать: Политика 10 с encryption aes, authentication pre-share, group 5

3. Проверить набор преобразований (Фаза 2)
R1# show crypto ipsec transform-set
Что показать: Набор VPN-SET с esp-aes и esp-sha-hmac

4. Проверить Security Associations (САМАЯ ВАЖНАЯ!)
R1# show crypto ipsec sa
Что показать ДО ping: pkts encapsulated: 0
Что показать ПОСЛЕ ping с PC-A на PC-C: pkts encapsulated: >0 - это доказывает работу туннеля!

5. Проверить IKE сессии
R1# show crypto isakmp sa
Что показать: Активное соединение с адресом 10.2.2.2 и статусом QM_IDLE

6. Проверить ACL для "интересного" трафика
R1# show access-list 110
Что показать: Разрешающее правило для 192.168.1.0 → 192.168.3.0

Что доказывает работа:
Безопасность: Трафик между сетями шифруется (не читается на R2)
Избирательность: Только "интересный" трафик шифруется (ping до PC-B не увеличивает счетчики)
Автоматизм: Туннель поднимается сам при появлении трафика

Пароли для доступа:
Привилегированный режим: ciscoenpa55
Консоль: ciscoconpa55
VTY: ciscovtypa55
SSH: SSHadmin/ciscosshpa55
